def caching_fibonacci():
    # Визначення зовнішньої функції, що повертає функцію fibonacci з кешем.

    cache = {}  # Ініціалізація кешу для зберігання результатів обчислень.

    def fibonacci(n):
        # Визначення функції fibonacci для обчислення числа Фібоначчі з номером n.

        if n <= 0:
            return 0  # Повернення 0 для випадку n <= 0 (неіснуючі номери Фібоначчі).
        elif n == 1:
            return 1  # Повернення 1 для випадку n == 1 (перший номер Фібоначчі).
        elif n in cache:
            return cache[n]  # Повернення результату з кешу, якщо він вже був обчислений.

        # Якщо результат не знаходиться в кеші, обчислюємо його.
        else:
            cache[n] = fibonacci(n - 1) + fibonacci(n - 2)  # Обчислення числа Фібоначчі та збереження його у кеші.
            return cache[n]  # Повернення обчисленого значення.

    return fibonacci  # Повернення внутрішньої функції fibonacci.


fib = caching_fibonacci()  # Створення екземпляру функції fibonacci з кешем.

print(fib(5))  # Виведення результату обчислення п'ятого числа Фібоначчі.
print(fib(10))  # Виведення результату обчислення десятого числа Фібоначчі.
